openfoam/arc_M1.6_buf0/system/postProcess
// Function-object definitions included into controlDict's functions {} block.
// Freestream values are included at the controlDict root and referenced here.

// HiSA is a true compressible solver with a live rho field and real pressure
// in Pa, so the forces object integrates against the actual density (rho rho),
// not a constant rhoInf. force.dat/moment.dat are therefore true N / N·m;
// scripts/post_process.py does the q-infinity normalization.
forces
{
    type            forces;
    libs            (forces);
    patches         (fuselage stabilizers);
    writeControl    timeStep;
    writeInterval   1;
    log             no;
    CofR            (0 0 0);
    rho             rho;
}

MachNo
{
    type            MachNo;
    libs            (fieldFunctionObjects);
    writeControl    writeTime;
}

gradRho
{
    type         grad;
    libs         (fieldFunctionObjects);
    field        rho;
    result       gradRho;
    writeControl writeTime;
}
magGradRho
{
    type         mag;
    libs         (fieldFunctionObjects);
    field        gradRho;
    result       schlieren;
    writeControl writeTime;
}

gradP
{
    type         grad;
    libs         (fieldFunctionObjects);
    field        p;
    result       gradP;
    writeControl writeTime;
}
magGradP
{
    type         mag;
    libs         (fieldFunctionObjects);
    field        gradP;
    result       magGradP;
    writeControl writeTime;
}

pressureCoeff
{
    type            pressure;
    libs            (fieldFunctionObjects);
    mode            staticCoeff;
    result          Cp;
    rhoInf          $rhoInf;
    pInf            $pInf;
    UInf            $UInf;
    writeControl    writeTime;
}

yPlus
{
    type         yPlus;
    libs         (fieldFunctionObjects);
    writeControl writeTime;
    log yes;
}

wallShearStress
{
    type         wallShearStress;
    libs         (fieldFunctionObjects);
    patches      (fuselage stabilizers);
    writeControl writeTime;
}
